# 1)შევქმნათ 2 ცვლადი მათში მოვათავსეთ integer (მთელი რიცხვი) მონაცემთა 
# ტიპები და მოახდინეთ ყველა მათემატიკური ოპერატორი ასევე კომენტარების სახით ახსენით რას აკეთებს თითოეული ოპერატორი

x = 1

y = 2

print(x+y)
# ორ ცვლადს ამატებს ერთმანეთს

print(x-y)
# ორ ცვლადს აკლებს ერთმანეთს

print(x*y)
# ორ ცვლადს ამრავლებს ერთმანეთზე

print(x//y)
# ორ ცვლადს ყოფს ერთმანეთზე

# 2)შევქმნათ 1 ცვლადი, სახელად name შეინახავ string (მონაცემთა ტიპს) შემდგომ ამ mnae
#  ცვლადში შეინახე შენი სახელი და ეს სახელი გაამრავლე 11 ზე კომენტარის სახით მიაწერე რა გამოვა output:

name = "Tazo"

print(name * 11) 

# 3)შევქმნათ 2 ცვლადი პირველი იყოს name სადაც შეინახავ შენს სახელს მეორე იყოს surname
#  სადაც შეინახავ შენს გვარს შემდეგ + ის გამოყენებით მოახდინეთ მათზე კონკატინაცია ანუ (ორი სტრინგის შეერთება)

name = "Tazo"

surname = "Andronikashvili"

print(name + " " + surname)

# 4)გამოიტანეთ ტერმინალში თქვენი სახელი და გვარი 100-ჯერ(გამოიყენეთ გამრავლება)

my_name_and_surname = "Tazo Andronikashvili"

print(my_name_and_surname * 100)